---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ExchangeId
source: html/ae06d4ac-5464-7a23-79cc-2f958605b83a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ExchangeId Property

"Exchange ID"

## Syntax (C#)
```csharp
public static ForgeTypeId ExchangeId { get; }
```